/**
     *  Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включитель
     */
    public class getLesson {
        public static void main(String[] args) {
            for (int i = 10; i < 21; i++) {
                System.out.println(Math.pow(i,2));
            }
        }
    }


